<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>PayloadContent</key>
      <array>
         <dict>
            <key>DefaultsData</key>
            <dict>
               <key>apns</key>
               <array>
                  <dict>
                     <key>apn</key>
                     <string>${APN}</string>
                     <key>password</key>
                     <data>${Password}</data>
                     <key>proxy</key>
                     <string>${Proxy}</string>
                     <key>proxyPort</key>
                     <integer>${ProxyPort}</integer>
                     <key>username</key>
                     <string>${Username}</string>
                  </dict>
               </array>
            </dict>
            <key>DefaultsDomainName</key>
            <string>com.apple.managedCarrier</string>
            <key>PayloadDescription</key>
            <string>Provides customization of carrier Access Point Name.</string>
            <key>PayloadDisplayName</key>
            <string>${PayloadDisplayName}</string>
            <key>PayloadIdentifier</key>
            <string>${PayloadIdentifier}</string>
            <key>PayloadOrganization</key>
            <string>${PayloadOrganization}</string>
            <key>PayloadType</key>
            <string>com.apple.apn.managed</string>
            <key>PayloadUUID</key>
            <string>${PayloadUUID}</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
         </dict>
      </array>
      <key>PayloadDescription</key>
      <string>APN Config</string>
      <key>PayloadDisplayName</key>
      <string>${PayloadDisplayName}</string>
      <key>PayloadIdentifier</key>
      <string>${PayloadIdentifier}</string>
      <key>PayloadOrganization</key>
      <string>${PayloadOrganization}</string>
      <key>PayloadRemovalDisallowed</key>
      <false />
      <key>PayloadType</key>
      <string>Configuration</string>
      <key>PayloadUUID</key>
      <string>${PayloadUUID}</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
   </dict>
</plist>