<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>PayloadContent</key>
      <array>
         <dict>
            <key>LDAPAccountDescription</key>
            <string>${LDAPAccountDescription}</string>
            <key>LDAPAccountHostName</key>
            <string>${LDAPAccountHostName}</string>
            <key>LDAPAccountPassword</key>
            <string>${LDAPAccountPassword}</string>
            <key>LDAPAccountUseSSL</key>
            ${LDAPAccountUseSSL}
            <key>LDAPAccountUserName</key>
            <string>${LDAPAccountUserName}</string>
            <key>LDAPSearchSettings</key>
            <array>
               <dict>
                  <key>LDAPSearchSettingDescription</key>
                  <string>My Search</string>
                  <key>LDAPSearchSettingScope</key>
                  <string>LDAPSearchSettingScopeSubtree</string>
                  <key>LDAPSearchSettingSearchBase</key>
                  <string>o=My Company</string>
               </dict>
            </array>
            <key>PayloadDescription</key>
            <string>Configures LDAP account.</string>
            <key>PayloadDisplayName</key>
            <string>${PayloadDisplayName}</string>
            <key>PayloadIdentifier</key>
            <string>${PayloadIdentifier}</string>
            <key>PayloadOrganization</key>
            <string>${PayloadOrganization}</string>
            <key>PayloadType</key>
            <string>com.apple.ldap.account</string>
            <key>PayloadUUID</key>
            <string>${PayloadUUID}</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
         </dict>
      </array>
      <key>PayloadDescription</key>
      <string>This profile will install LDAP configurations.</string>
      <key>PayloadDisplayName</key>
      <string>${PayloadDisplayName}</string>
      <key>PayloadIdentifier</key>
      <string>${PayloadIdentifier}</string>
      <key>PayloadOrganization</key>
      <string>${PayloadOrganization}</string>
      <key>PayloadRemovalDisallowed</key>
      <false />
      <key>PayloadType</key>
      <string>Configuration</string>
      <key>PayloadUUID</key>
      <string>${PayloadUUID}</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
   </dict>
</plist>