<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>PayloadContent</key>
      <array>
         <dict>
            <key>IPSec</key>
            <dict>
               <key>AuthenticationMethod</key>
               <string>${AuthenticationMethod}</string>
               <key>LocalIdentifier</key>
               <string>${LocalIdentifier}</string>
               <key>LocalIdentifierType</key>
               <string>${LocalIdentifierType}</string>
               <key>RemoteAddress</key>
               <string>${RemoteAddress}</string>
               <key>SharedSecret</key>
               <string>${SharedSecret}</string>
               <key>XAuthEnabled</key>
               <integer>${XAuthEnabled}</integer>
               <key>XAuthName</key>
               <string>${XAuthName}</string>
               <key>XAuthPasswordEncryption</key>
               <string>Prompt</string>
            </dict>
            <key>IPv4</key>
            <dict>
               <key>OverridePrimary</key>
               <integer>1</integer>
            </dict>
            <key>PayloadDescription</key>
            <string>Configures VPN settings, including authentication.</string>
            <key>PayloadDisplayName</key>
            <string>${PayloadDisplayName}</string>
            <key>PayloadIdentifier</key>
            <string>${PayloadIdentifier}</string>
            <key>PayloadOrganization</key>
            <string>${PayloadOrganization}</string>
            <key>PayloadType</key>
            <string>com.apple.vpn.managed</string>
            <key>PayloadUUID</key>
            <string>${PayloadUUID}</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>Proxies</key>
            <dict>
               <key>HTTPEnable</key>
               <integer>0</integer>
               <key>HTTPProxyType</key>
               <string>None</string>
               <key>HTTPSEnable</key>
               <integer>0</integer>
               <key>ProxyAutoConfigEnable</key>
               <integer>0</integer>
               <key>ProxyAutoDiscoveryEnable</key>
               <integer>0</integer>
            </dict>
            <key>UserDefinedName</key>
            <string>display name</string>
            <key>VPNType</key>
            <string>IPSec</string>
         </dict>
      </array>
      <key>PayloadDescription</key>
      <string>This profile will enable VPN.</string>
      <key>PayloadDisplayName</key>
      <string>${PayloadDisplayName}</string>
      <key>PayloadIdentifier</key>
      <string>${PayloadIdentifier}</string>
      <key>PayloadOrganization</key>
      <string>${PayloadOrganization}</string>
      <key>PayloadRemovalDisallowed</key>
      <false />
      <key>PayloadType</key>
      <string>Configuration</string>
      <key>PayloadUUID</key>
      <string>${PayloadUUID}</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
   </dict>
</plist>